In [3]:
import pandas as pd

In [5]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [6]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [7]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [8]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

## Try it yourself

##### Problem 1: Create a dataframe to display the result as below:

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data">
</center>

In [10]:
x = {
    'Student' : ['David','Samuel','Terry','Evan'],
    'Age' : [27,24,22,32],
    'Country' : ['UK','Canada','China','USA'],
    'Course' : ['Python','Data Structures','Machine Learning','Web Develpoment'],
    'Marks' : [85,72,89,76]
}

df1 = pd.DataFrame(x)
df1

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Develpoment     76

##### Problem 2: Retrieve the Marks column and assign it to a variable b

In [13]:
b = df1[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

##### Problem 3: Retrieve the Country and Course columns and assign it to a variable c

In [16]:
c = df1[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Develpoment

##### To view the column as a series, just use one bracket:

In [17]:
# Get the Student column as a series Object
x = df1['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [18]:
#check the type of x
type(x)

pandas.core.series.Series

<Center>

## Exercise 2: loc() and iloc() functions
</Center>

In [21]:
df2 = df
df2

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [23]:
# Use the loc() function,to get the Department of Jane in the newly created dataframe df2.
df2.loc[2,'Department']

'Design Team'

In [29]:
# Use the iloc() function to get the Salary of Mary in the newly created dataframe df2.
x = df2.iloc[3,3]
x

np.int64(60000)

In [34]:
# Using loc() function, do slicing on old dataframe df to retrieve the Name, ID and department of index column having labels as 2,3

df2.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure